Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДтЧтение</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКтЧтение</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ЗакрытиеМесяца/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнить можно только не проведенный документ. Снимите проведение.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанными()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОбороты.Субконто1 КАК Статья,
	|	СУММА(УправленческийОбороты.СуммаОборотДт) КАК Расход,
	|	СУММА(УправленческийОбороты.СуммаОборотКт) КАК Доход
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение, , ) КАК УправленческийОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОбороты.Субконто1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доход УБЫВ,
	|	Расход УБЫВ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Объект.Список.Загрузить(Результат.Выгрузить());
	
	Объект.СуммаДоходов = Объект.Список.Итог("Доход");
	Объект.СуммаРасходов = Объект.Список.Итог("Расход");
	
	Объект.СуммаДокумента = Объект.СуммаДоходов - Объект.СуммаРасходов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Дата = КонецМесяца(Объект.Дата);
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПередЗаписьюНаСервере()
	
КонецФункции

	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	УправленческийОбороты.Субконто1 КАК ОборотСтатья,
	//|	СУММА(УправленческийОбороты.СуммаОборотДт) КАК ОборотДт,
	//|	СУММА(УправленческийОбороты.СуммаОборотКт) КАК ОборотКт
	//|ПОМЕСТИТЬ ОборотыБезПроведенных
	//|ИЗ
	//|	РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение, , ) КАК УправленческийОбороты
	//|ГДЕ
	//|	УправленческийОбороты.Регистратор <> &Регистратор
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УправленческийОбороты.Субконто1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЕСТЬNULL(Остатки.Субконто1, ОборотыБезПроведенных.ОборотСтатья) КАК Статья,
	//|	ВЫБОР
	//|		КОГДА ОборотыБезПроведенных.ОборотКт ЕСТЬ NULL 
	//|			ТОГДА ЕСТЬNULL(Остатки.СуммаОстатокКт, 0)
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА Остатки.СуммаОстатокКт ЕСТЬ NULL 
	//|					ТОГДА ОборотыБезПроведенных.ОборотКт
	//|				ИНАЧЕ Остатки.СуммаОстатокКт + ОборотыБезПроведенных.ОборотКт
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Доход,
	//|	ВЫБОР
	//|		КОГДА ОборотыБезПроведенных.ОборотДт ЕСТЬ NULL 
	//|			ТОГДА ЕСТЬNULL(Остатки.СуммаОстатокДт, 0)
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА Остатки.СуммаОстатокДт ЕСТЬ NULL 
	//|					ТОГДА ОборотыБезПроведенных.ОборотДт
	//|				ИНАЧЕ Остатки.СуммаОстатокДт + ОборотыБезПроведенных.ОборотДт
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Расход
	//|ИЗ
	//|	РегистрБухгалтерии.Управленческий.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение) КАК Остатки
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ОборотыБезПроведенных КАК ОборотыБезПроведенных
	//|		ПО Остатки.Субконто1 = ОборотыБезПроведенных.ОборотСтатья
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Расход";
